export const TEXTS = {
   common: {
      tags: "תגיות",
      sizes: "מידות",
      preview: "תצוגה מקדימה",
      pictures: "תמונות",
      save: "שמירה",
      price: "מחיר",
      askAboutDress: "פרטים על השמלה",
      shareBtn: "שתפי שמלה",
      shareTitle: "קלטי איזו שמלה מושלמת!",
   },
   routesTitles: {
      home: "בית",
      about: "שאלות נפוצות",
      catalog: "קטלוג שמלות",
      guide: "מדריך",
      newDress: "הוספת שמלה",
   },
   newDress: {
      dressTitle: "כותרת שמלה",
      missingFields: "חסרים שדות",
   },
   askAboutDress: "היי, בנוגע לשמלה הזאת - ",
   modalConfirm: {
      cancel: "ביטול",
      confirmBtn: "אישור",
      yes: "כן",
   },
   messages: {
      delete: "למחוק את - ",
   },
   tags: [
      "מחוך",
      "טול",
      "מקסי",
      "מידי",
      "סאטן",
      "תחרה",
      "שחור",
      "צבעוני",
      "מידות גדולות",
   ],
   sizes: ["36", "38", "40", "42"],
};

export const METADATA = {
   siteTitle: "תהילה בר-לב",
   homePage: {
      title: "בית",
      description: "מבחר שמלות ערב צנועות להשכרה מאת המעצבת תהילה בר-לב.",
   },
   catalog: {
      title: TEXTS.routesTitles.catalog,
      description:
         "סטודיו תהילה בר-לב | מבחר שמלות ערב צנועות להשכרה מאת המעצבת תהילה בר-לב.",
   },
};

export const q_and_a = [
   {
      question: "קצת עלי",
      answer:
         "היי בנות, אני תהילה בר-לב ורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית לורם איפסום דולור סיט אמט, קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול",
   },
   {
      question: "איפה הסטודיו נמצא?",
      answer: "הסטודיו נמצא באשקלון",
   },
   {
      question: "האם צריך לתאם מראש כדי להגיע לסטודיו?",
      answer: "כן, אפשר להגיע לסטודיו רק בתיאום פגישה מראש",
   },
   {
      question: "אני אף לא השכרתי שמלה, איך זה עובד?",
      answer:
         "את מגיעה לסטודיו פעם ראשונה להתרשם ולמדוד את השמלות, במידה ואת רוצה לסגור שמלה אנחנו נבדוק את הזמינות שלה, במידה והיא פנויה כדי לשריין שמלה לתאריך שלך את משלמת 150₪ פיקדון שלא קשור לתשלום עצמו של השמלה. אסיפת השמלה נעשית עד יומיים לפני האירוע וההחזרה של השמלה עד יומיים אחרי.",
   },
   {
      question: "האם את עושה הנחות?",
      answer: "לא, אני לא מורידה במחיר של השמלות",
   },
   {
      question: "האם ניתן לעשות שינויים בשמלות?",
      answer: "לא ניתן לשנות את עיצוב השמלה",
   },
   {
      question: "האם אפשר לעשות תיקונים לשמלות?",
      answer: "כמובן, תיקונים כמו- הרחבה והצרה למידות שלך",
   },
   {
      question: "כמה התיקונים עולים?",
      answer:
         "התיקונים כוללים עם סכום השמלה, אלה אם יש שינויים גדולים לעשות, ואז זה תלוי בתיקון עצמי",
   },
   {
      question: "מתי אני משלמת על השמלה?",
      answer: "ביום שאת באה לאסוף אותה",
   },
   {
      question: "מתי עושים תיקונים?",
      answer: "ביום שאת באה לאסוף את השמלה אנחנו עושות את התיקונים במקום",
   },
   {
      question: "כמה זמן לוקח התיקונים?",
      answer: "זה יכול לקחת עד שעה וחצי",
   },
   {
      question: "האם ניתן לעשות משלוח?",
      answer:
         "לא, לא ניתן לעשות משלוח. צריך להגיע לסטודיו בכדי למדוד. גם לאסיפה וגם להחזרה.",
   },
   {
      question: "מתי את מחזירה את הפיקדון?",
      answer: "אחרי שהשמלה עוברת אצלי בדיקה וניקוי.",
   },
   {
      question: "האם את עושה גם תפירות אישיות?",
      answer: "כן, אני עושה תפירה אישית",
   },
   {
      question: "איך עובד התפירה האישית?",
      answer:
         "את קודם כל שולחת לי תמונות השראה כדי להראות לי את הסגנון שאת מחפשת, במידה וזה מתאים לסגנון שלי. אני יושבת ומציירת לך כמה סקיצות בשפה של הסגנון שאת מחפשת.",
   },
   {
      question:
         "אם אני מביאה לך תמונה של שמלה שאני רוצה את יכולה לתפור לי אותה?",
      answer: "לא, אני תופרת רק עיצובים שלי.",
   },
   {
      question: "מה עלות של תפירה אישית?",
      answer: "זה מאוד תלוי בבד ובגזרה, המחיר מתחיל מ1400₪ להשכרה.",
   },
];
