export const TEXTS = {
   common: {
      tags: "תגיות",
      sizes: "מידות",
      preview: "תצוגה מקדימה",
      pictures: "תמונות",
      save: "שמירה",
      price: "מחיר",
      askAboutDress: "פרטים על השמלה",
      shareBtn: "שתפי שמלה",
      shareTitle: "קלטי איזו שמלה מושלמת!",
   },
   routesTitles: {
      home: "בית",
      about: "שאלות נפוצות",
      catalog: "קטלוג שמלות",
      guide: "מדריך",
      newDress: "הוספת שמלה",
   },
   newDress: {
      dressTitle: "כותרת שמלה",
      missingFields: "חסרים שדות",
   },
   askAboutDress: "היי, בנוגע לשמלה הזאת - ",
   modalConfirm: {
      cancel: "ביטול",
      confirmBtn: "אישור",
      yes: "כן",
   },
   messages: {
      delete: "למחוק את - ",
   },
   tags: [
      "מחוך",
      "טול",
      "מקסי",
      "מידי",
      "סאטן",
      "תחרה",
      "שחור",
      "צבעוני",
      "מידות גדולות",
   ],
   sizes: ["36", "38", "40", "42"],
};

export const METADATA = {
   siteTitle: "תהילה בר-לב",
   homePage: {
      title: "בית",
      description: "מבחר שמלות ערב צנועות להשכרה מאת המעצבת תהילה בר-לב.",
   },
   catalog: {
      title: TEXTS.routesTitles.catalog,
      description:
         "סטודיו תהילה בר-לב | מבחר שמלות ערב צנועות להשכרה מאת המעצבת תהילה בר-לב.",
   },
};

export const q_and_a = [
   {
      question: "קצת עלי",
      answer:
         "היי בנות, אני תהילה בר-לב ורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית לורם איפסום דולור סיט אמט, קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול",
   },
   {
      question: "איפה הסטודיו נמצא?",
      answer: "הסטודיו נמצא באשקלון.",
   },
   {
      question: "האם צריך לתאם מראש כדי להגיע לסטודיו?",
      answer: "כן, יש לתאם פגישה מראש.",
   },
   {
      question: "אני אף פעם לא השכרתי שמלה, איך זה עובד?",
      answer:
         "את מגיעה לסטודיו פעם ראשונה להתרשם ולמדוד את השמלות. במידה ואת רוצה לסגור שמלה, נבדוק את הזמינות שלה. אם היא פנויה, כדי לשריין אותה לתאריך שלך, תשלמי פיקדון של 150₪ שאינו קשור לתשלום עבור השמלה. איסוף השמלה נעשה עד יומיים לפני האירוע והחזרתה עד יומיים אחריו.",
   },
   {
      question: "האם את עושה הנחות?",
      answer: "לא, אין הנחות על השמלות.",
   },
   {
      question: "האם ניתן לעשות שינויים בשמלות?",
      answer: "לא ניתן לשנות את עיצוב השמלה.",
   },
   {
      question: "האם אפשר לעשות תיקונים לשמלות?",
      answer: "כמובן, אפשר לעשות תיקונים כמו הרחבה והצרה למידות שלך.",
   },
   {
      question: "כמה עולים התיקונים?",
      answer:
         "התיקונים כלולים במחיר השמלה, אלא אם יש שינויים גדולים שדורשים תיקון מיוחד.",
   },
   {
      question: "מתי אני משלמת על השמלה?",
      answer: "ביום שאת באה לאסוף אותה.",
   },
   {
      question: "מתי עושים תיקונים?",
      answer: "ביום שאת באה לאסוף את השמלה אנחנו עושות את התיקונים במקום.",
   },
   {
      question: "כמה זמן לוקחים התיקונים?",
      answer: "זה יכול לקחת עד שעה וחצי.",
   },
   {
      question: "האם ניתן לעשות משלוח?",
      answer: "לא, יש להגיע לסטודיו למדידה, לאיסוף ולהחזרה.",
   },
   {
      question: "מתי את מחזירה את הפיקדון?",
      answer: "אחרי שהשמלה עוברת בדיקה וניקוי.",
   },
   {
      question: "האם את עושה גם תפירות אישיות?",
      answer: "כן, אני עושה תפירה אישית.",
   },
   {
      question: "איך עובד התפירה האישית?",
      answer:
         "את שולחת לי תמונות השראה כדי להראות לי את הסגנון שאת מחפשת. אם זה מתאים לסגנון שלי, אני יושבת ומציירת לך כמה סקיצות.",
   },
   {
      question:
         "אם אני מביאה לך תמונה של שמלה שאני רוצה, את יכולה לתפור לי אותה?",
      answer: "לא, אני תופרת רק עיצובים שלי.",
   },
   {
      question: "מה עלות של תפירה אישית?",
      answer: "המחיר תלוי בבד ובגזרה, ומתחיל מ-1400₪ להשכרה.",
   },
];
